#### Visible Property

---

|  |
| --- |
| CurveByPoints Class   See Also |

Whether the point is visible when the family is loaded into a project.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool Visible { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Visible As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool Visible { 	bool get (); 	void set (bool value); } ``` |

# See Also

CurveByPoints Class

Autodesk.Revit.DB Namespace

#### CitySetIterator Class

---

|  |
| --- |
| Members   See Also |

An iterator to a city set.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public abstract class CitySetIterator : APIObject,  	IEnumerator ``` |

| Visual Basic |
| --- |
| ``` Public MustInherit Class CitySetIterator _ 	Inherits APIObject _ 	Implements IEnumerator ``` |

| Visual C++ |
| --- |
| ``` public ref class CitySetIterator abstract : public APIObject,  	IEnumerator ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB APIObject
  Autodesk.Revit.DB CitySetIterator

# See Also

CitySetIterator Members

Autodesk.Revit.DB Namespace

#### NullParameterValue Class

---

|  |
| --- |
| Members   See Also |

A class that represent an empty (null) value of a parameter element.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016 Subscription Update

# Syntax

| C# |
| --- |
| ``` public class NullParameterValue : ParameterValue ``` |

| Visual Basic |
| --- |
| ``` Public Class NullParameterValue _ 	Inherits ParameterValue ``` |

| Visual C++ |
| --- |
| ``` public ref class NullParameterValue : public ParameterValue ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB ParameterValue
  Autodesk.Revit.DB NullParameterValue

# See Also

NullParameterValue Members

Autodesk.Revit.DB Namespace

#### IsValidGlobalParameter Method

---

|  |
| --- |
| GlobalParametersManager Class   See Also |

Tests whether an ElementId is of a global parameter in the given document.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2016 Subscription Update

# Syntax

| C# |
| --- |
| ``` public static bool IsValidGlobalParameter( 	Document document, 	ElementId parameterId ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsValidGlobalParameter ( _ 	document As Document, _ 	parameterId As ElementId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsValidGlobalParameter( 	Document^ document,  	ElementId^ parameterId ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document containing the global parameter.

parameterId
:   Type:  Autodesk.Revit.DB ElementId
     Id of a global parameter

#### Return Value

Returns True if the Id is of a valid global parameter; False otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

GlobalParametersManager Class

Autodesk.Revit.DB Namespace

#### Create Method (Document, ElementId, ElementId, XYZ, Int32)

---

|  |
| --- |
| ScheduleSheetInstance Class   See Also |

Creates an instance of a schedule segment on a sheet.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2022.1

# Syntax

| C# |
| --- |
| ``` public static ScheduleSheetInstance Create( 	Document document, 	ElementId viewSheetId, 	ElementId scheduleId, 	XYZ origin, 	int segmentIndex ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	document As Document, _ 	viewSheetId As ElementId, _ 	scheduleId As ElementId, _ 	origin As XYZ, _ 	segmentIndex As Integer _ ) As ScheduleSheetInstance ``` |

| Visual C++ |
| --- |
| ``` public: static ScheduleSheetInstance^ Create( 	Document^ document,  	ElementId^ viewSheetId,  	ElementId^ scheduleId,  	XYZ^ origin,  	int segmentIndex ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document

viewSheetId
:   Type:  Autodesk.Revit.DB ElementId
     The id of the sheet where the schedule segment will be placed.

scheduleId
:   Type:  Autodesk.Revit.DB ElementId
     The id of the schedule view.

origin
:   Type:  Autodesk.Revit.DB XYZ
     Location on the sheet where the schedule segment will be placed.

segmentIndex
:   Type:  System Int32
     The schedule segment index of the schedule instance.

#### Return Value

The new ScheduleInstance.

# Remarks

The segment index value could be -1, which means to create an instance for the entire schedule, see  SegmentIndex  property for more details.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | scheduleId is not a ViewSchedule that can be added to sheets. "Internal" schedules are not user-visible but are filtered by sheet or used to manage Revisions, which cannot be added to sheets. -or- viewSheetId is not a ViewSheet. -or- segmentIndex is not a valid segment index. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ModificationForbiddenException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process. |
| Autodesk.Revit.Exceptions ModificationOutsideTransactionException | The document has no open transaction. |

# See Also

ScheduleSheetInstance Class

Create Overload

Autodesk.Revit.DB Namespace

#### PointFlexibleConstrained Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Constrained"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PointFlexibleConstrained { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PointFlexibleConstrained As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PointFlexibleConstrained { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Construction Property

---

|  |
| --- |
| GroupTypeId Class   See Also |

"Construction"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId Construction { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property Construction As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ Construction { 	ForgeTypeId^ get (); } ``` |

# See Also

GroupTypeId Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| UpdaterInfo Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

UpdaterInfo Class

Autodesk.Revit.DB Namespace

#### DivideVolumesProfilesGapForWidthAll Property

---

|  |
| --- |
| BuiltInFailures DPartFailures Class   See Also |

Division family cannot be used with the selected division gap for all widths of hosts

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId DivideVolumesProfilesGapForWidthAll { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DivideVolumesProfilesGapForWidthAll As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ DivideVolumesProfilesGapForWidthAll { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures DPartFailures Class

Autodesk.Revit.DB Namespace

#### GetInsulationLiningGeometry Method

---

|  |
| --- |
| FabricationPart Class   See Also |

Gets insulation and lining geometry for this fabrication part.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2019.1

# Syntax

| C# |
| --- |
| ``` public GeometryElement GetInsulationLiningGeometry() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetInsulationLiningGeometry As GeometryElement ``` |

| Visual C++ |
| --- |
| ``` public: GeometryElement^ GetInsulationLiningGeometry() ``` |

#### Return Value

Returns any insulation and liner geometry.

# See Also

FabricationPart Class

Autodesk.Revit.DB Namespace

#### SetSpecificFittingAngleStatus Method

---

|  |
| --- |
| PipeSettings Class   See Also |

Sets the status of given specific angle.

**Namespace:**   Autodesk.Revit.DB.Plumbing
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public void SetSpecificFittingAngleStatus( 	double angle, 	bool bStatus ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetSpecificFittingAngleStatus ( _ 	angle As Double, _ 	bStatus As Boolean _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetSpecificFittingAngleStatus( 	double angle,  	bool bStatus ) ``` |

#### Parameters

angle
:   Type:  System Double
     The specific angle (in degree) that must be one of 60, 45, 30, 22.5 or 11.25 degrees.

bStatus
:   Type:  System Boolean
     Status, true - using the given angle during the pipe layout.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | The given value for angle must be 90, 60, 45, 30, 22.5 or 11.25 degrees. |
| Autodesk.Revit.Exceptions InvalidOperationException | Can not set an angle status for an invalid angle. |

# See Also

PipeSettings Class

Autodesk.Revit.DB.Plumbing Namespace

#### FormUtils Class

---

|  |
| --- |
| Members   See Also |

Define Form utility functions

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static class FormUtils ``` |

| Visual Basic |
| --- |
| ``` Public NotInheritable Class FormUtils ``` |

| Visual C++ |
| --- |
| ``` public ref class FormUtils abstract sealed ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB FormUtils

# See Also

FormUtils Members

Autodesk.Revit.DB Namespace

#### SheetAssemblyTypeMark Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Assembly: Type Mark"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SheetAssemblyTypeMark { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SheetAssemblyTypeMark As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SheetAssemblyTypeMark { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### RebarSystemHookTypeFrontDirn2 Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Exterior Minor Hook Type"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RebarSystemHookTypeFrontDirn2 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RebarSystemHookTypeFrontDirn2 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RebarSystemHookTypeFrontDirn2 { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CanFilterByValuePresence Method

---

|  |
| --- |
| ScheduleDefinition Class   See Also |

Checks whether a field can be used with a value presence-based filter.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2020

# Syntax

| C# |
| --- |
| ``` public bool CanFilterByValuePresence( 	ScheduleFieldId fieldId ) ``` |

| Visual Basic |
| --- |
| ``` Public Function CanFilterByValuePresence ( _ 	fieldId As ScheduleFieldId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool CanFilterByValuePresence( 	ScheduleFieldId^ fieldId ) ``` |

#### Parameters

fieldId
:   Type:  Autodesk.Revit.DB ScheduleFieldId
     The ID of the field to check.

#### Return Value

True if the field can be used with a value presence filter, false otherwise.

# Remarks

The value presence filter types are HasValue and HasNoValue.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | fieldId is not the ID of a field in this ScheduleDefinition. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ScheduleDefinition Class

Autodesk.Revit.DB Namespace

#### RepeatElements Method

---

|  |
| --- |
| ComponentRepeater Class   See Also |

Repeats a set of adaptive component hosted on one or more repeating references.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public static IList<ComponentRepeater> RepeatElements( 	Document document, 	ICollection<ElementId> elementIds ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function RepeatElements ( _ 	document As Document, _ 	elementIds As ICollection(Of ElementId) _ ) As IList(Of ComponentRepeater) ``` |

| Visual C++ |
| --- |
| ``` public: static IList<ComponentRepeater^>^ RepeatElements( 	Document^ document,  	ICollection<ElementId^>^ elementIds ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document that contains the elements.

elementIds
:   Type:  System.Collections.Generic ICollection   ElementId
     The set of adaptive components used as an input pattern for the repeating operation.

#### Return Value

One or more component repeater objects representing the result pattern of the repeating operation.

# Remarks

All elements must be adaptive family instances and have no shape handles. At least one placement point must be hosted on a 1D or 2D repeating reference. All other placement points can be hosted on a 0D, 1D or 2D repeating reference, or must be unhosted. Use  CanElementBeRepeated(Document, ElementId)  to test whether an element meets these conditions.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The document does not allow creation of a component repeater. -or- The given element id set is empty. -or- One or more elements in elementIds do not exist in the document. -or- Not all given elements can be repeated. All elements must be adaptive family instances, have no shape handles, and have at least one placement point hosted on a 1D or 2D repeating reference. The remaining placement points must be either unhosted or hosted on another repeating reference. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ModificationForbiddenException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process. |
| Autodesk.Revit.Exceptions ModificationOutsideTransactionException | The document has no open transaction. |

# See Also

ComponentRepeater Class

Autodesk.Revit.DB Namespace

#### FbxLightPhotometricFileCache Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"None"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId FbxLightPhotometricFileCache { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FbxLightPhotometricFileCache As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ FbxLightPhotometricFileCache { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### RbsElecAnalyticalLoadSetOnStandby Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Quantity of Standby"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsElecAnalyticalLoadSetOnStandby { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsElecAnalyticalLoadSetOnStandby As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsElecAnalyticalLoadSetOnStandby { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| LineSegment Class   See Also |

Releases all resources used by the  LineSegment

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

LineSegment Class

Autodesk.Revit.DB Namespace

#### BuiltInFailures.LegendFailures Class

---

|  |
| --- |
| BuiltInFailures Class   Members   See Also |

Failures about Legend.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static class LegendFailures ``` |

| Visual Basic |
| --- |
| ``` Public NotInheritable Class LegendFailures ``` |

| Visual C++ |
| --- |
| ``` public ref class LegendFailures abstract sealed ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB BuiltInFailures LegendFailures

# See Also

BuiltInFailures LegendFailures Members

Autodesk.Revit.DB Namespace

#### GetSubelements Method

---

|  |
| --- |
| Element Class   See Also |

Returns the collection of element subelements.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public IList<Subelement> GetSubelements() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetSubelements As IList(Of Subelement) ``` |

| Visual C++ |
| --- |
| ``` public: IList<Subelement^>^ GetSubelements() ``` |

#### Return Value

The collection of element subelements.

# Remarks

This collection will not include the Element itself.

# See Also

Element Class

Autodesk.Revit.DB Namespace

#### DecalSubcategoryId Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Subcategory"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId DecalSubcategoryId { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DecalSubcategoryId As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ DecalSubcategoryId { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### HasThermalProperties Method

---

|  |
| --- |
| FamilySymbol Class   See Also |

Identifies if this FamilySymbol can include thermal properties.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public bool HasThermalProperties() ``` |

| Visual Basic |
| --- |
| ``` Public Function HasThermalProperties As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool HasThermalProperties() ``` |

#### Return Value

True if the FamilySymbol can include thermal properties, false otherwise.

# See Also

FamilySymbol Class

Autodesk.Revit.DB Namespace

#### CannotDrawBlend Property

---

|  |
| --- |
| BuiltInFailures BlendFailures Class   See Also |

Can't create blend.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotDrawBlend { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotDrawBlend As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotDrawBlend { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures BlendFailures Class

Autodesk.Revit.DB Namespace

#### RbsParallelconduitsHorizontalNumber Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Horizontal Number for parallel conduits"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsParallelconduitsHorizontalNumber { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsParallelconduitsHorizontalNumber As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsParallelconduitsHorizontalNumber { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### PhyMaterialParamTensionParallel Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Tension Parallel to Grain"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PhyMaterialParamTensionParallel { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PhyMaterialParamTensionParallel As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PhyMaterialParamTensionParallel { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### FbxLightLumenaireDirt Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Luminaire Dirt Depreciation"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId FbxLightLumenaireDirt { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FbxLightLumenaireDirt As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ FbxLightLumenaireDirt { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### AddConstraintSagittaLength Method

---

|  |
| --- |
| RebarShapeDefinitionByArc Class   See Also |

Specify a parameter to drive the sagittal length (the height of the circular segment, measured perpendicular to the chord).

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2009

# Syntax

| C# |
| --- |
| ``` public void AddConstraintSagittaLength( 	ElementId paramId ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub AddConstraintSagittaLength ( _ 	paramId As ElementId _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void AddConstraintSagittaLength( 	ElementId^ paramId ) ``` |

#### Parameters

paramId
:   Type:  Autodesk.Revit.DB ElementId
     Id of a parameter to drive the constraint. To obtain the id of a shared parameter, call RebarShape.GetElementIdForExternalDefinition().

# Remarks

The sagitta will be measured on the centerline of the bar.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

RebarShapeDefinitionByArc Class

Autodesk.Revit.DB.Structure Namespace

#### AlreadyHaveTwoClosurePlanes Property

---

|  |
| --- |
| BuiltInFailures RefPlaneFailures Class   See Also |

No more than two closure planes are allowed.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId AlreadyHaveTwoClosurePlanes { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property AlreadyHaveTwoClosurePlanes As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ AlreadyHaveTwoClosurePlanes { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures RefPlaneFailures Class

Autodesk.Revit.DB Namespace

#### IPrintSetting Interface

---

|  |
| --- |
| Members   See Also |

An interface which represents the Print Setup (Application Menu->Print->Print Setup) within Autodesk Revit.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public interface IPrintSetting ``` |

| Visual Basic |
| --- |
| ``` Public Interface IPrintSetting ``` |

| Visual C++ |
| --- |
| ``` public interface class IPrintSetting ``` |

# See Also

IPrintSetting Members

Autodesk.Revit.DB Namespace

#### ScheduleBaseLevelParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Base Level"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ScheduleBaseLevelParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ScheduleBaseLevelParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ScheduleBaseLevelParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### LipLength Property

---

|  |
| --- |
| StructuralSectionGeneralC Class   See Also |

Lip segment length.

**Namespace:**   Autodesk.Revit.DB.Structure.StructuralSections
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public double LipLength { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property LipLength As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double LipLength { 	double get (); 	void set (double value); } ``` |

# See Also

StructuralSectionGeneralC Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace

#### Create Method

---

|  |
| --- |
| AnalyticalPanel Class   See Also |

Creates a new instance of an Analytical Panel within the project.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public static AnalyticalPanel Create( 	Document aDoc, 	CurveLoop curveLoop ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	aDoc As Document, _ 	curveLoop As CurveLoop _ ) As AnalyticalPanel ``` |

| Visual C++ |
| --- |
| ``` public: static AnalyticalPanel^ Create( 	Document^ aDoc,  	CurveLoop^ curveLoop ) ``` |

#### Parameters

aDoc
:   Type:  Autodesk.Revit.DB Document
     Revit document.

curveLoop
:   Type:  Autodesk.Revit.DB CurveLoop
     CurveLoop for the Analytical Panel.

#### Return Value

The newly created AnalyticalPanel instance.

# Remarks

CurveLoop must be planar and not self-intersecting.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | One of the following requirements is not satisfied : - curve loop curveLoop is not planar - curve loop curveLoop is self-intersecting - curve loop curveLoop contains zero length curves |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ModificationForbiddenException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process. |
| Autodesk.Revit.Exceptions ModificationOutsideTransactionException | The document has no open transaction. |

# See Also

AnalyticalPanel Class

Autodesk.Revit.DB.Structure Namespace

#### CreateNotEqualsRule Method (ElementId, ElementId)

---

|  |
| --- |
| ParameterFilterRuleFactory Class   See Also |

Creates a filter rule that determines whether ElementId values from the document do not equal a certain value.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public static FilterRule CreateNotEqualsRule( 	ElementId parameter, 	ElementId value ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CreateNotEqualsRule ( _ 	parameter As ElementId, _ 	value As ElementId _ ) As FilterRule ``` |

| Visual C++ |
| --- |
| ``` public: static FilterRule^ CreateNotEqualsRule( 	ElementId^ parameter,  	ElementId^ value ) ``` |

#### Parameters

parameter
:   Type:  Autodesk.Revit.DB ElementId
     An ElementId-typed parameter used to get values from the document for a given element.

value
:   Type:  Autodesk.Revit.DB ElementId
     The user-supplied value against which values from the document will be compared.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ParameterFilterRuleFactory Class

CreateNotEqualsRule Overload

Autodesk.Revit.DB Namespace

#### AncestorIdx Property

---

|  |
| --- |
| DisplacementPath Class   See Also |

Specifies the end point of the path.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public int AncestorIdx { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property AncestorIdx As Integer 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property int AncestorIdx { 	int get (); 	void set (int value); } ``` |

# See Also

DisplacementPath Class

Autodesk.Revit.DB Namespace

#### BtuPerDegreeF Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol BTU/Â°F, indicating unit British thermal units per degree Fahrenheit.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId BtuPerDegreeF { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property BtuPerDegreeF As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ BtuPerDegreeF { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### RegionPhaseMismatch Property

---

|  |
| --- |
| BuiltInFailures SiteFailures Class   See Also |

Subregions must have the same Phase Created parameter and Phase Demolished parameter as the host Toposurface. Subregion phase will be set to match the Toposurface.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId RegionPhaseMismatch { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RegionPhaseMismatch As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ RegionPhaseMismatch { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures SiteFailures Class

Autodesk.Revit.DB Namespace

#### TrussBearingChordTopBottomParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Bearing Chord"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId TrussBearingChordTopBottomParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TrussBearingChordTopBottomParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ TrussBearingChordTopBottomParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Viscosity Property

---

|  |
| --- |
| FluidTemperature Class   See Also |

The dynamic viscosity value

**Namespace:**   Autodesk.Revit.DB.Plumbing
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public double Viscosity { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Viscosity As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double Viscosity { 	double get (); 	void set (double value); } ``` |

# See Also

FluidTemperature Class

Autodesk.Revit.DB.Plumbing Namespace

#### MetallicPaint Class

---

|  |
| --- |
| Members   See Also |

A static class that provides access to the property names that appear in the MetallicPaint visual asset schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static class MetallicPaint ``` |

| Visual Basic |
| --- |
| ``` Public NotInheritable Class MetallicPaint ``` |

| Visual C++ |
| --- |
| ``` public ref class MetallicPaint abstract sealed ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.Visual MetallicPaint

# See Also

MetallicPaint Members

Autodesk.Revit.DB.Visual Namespace

#### GetReferences Method

---

|  |
| --- |
| SelectionChangedEventArgs Class   See Also |

Returns the references that are currently selected.

**Namespace:**   Autodesk.Revit.UI.Events
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public IList<Reference> GetReferences() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetReferences As IList(Of Reference) ``` |

| Visual C++ |
| --- |
| ``` public: IList<Reference^>^ GetReferences() ``` |

#### Return Value

The collection containing the selected references.

# Remarks

The references can be an element or subelement in the host or a linked document.

# See Also

SelectionChangedEventArgs Class

Autodesk.Revit.UI.Events Namespace

#### CubicMetersPerHour Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Cubic meters per hour.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId CubicMetersPerHour { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CubicMetersPerHour As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ CubicMetersPerHour { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### PolymeshTopology Class

---

|  |
| --- |
| Members   See Also |

A class representing topology of a polymesh.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public class PolymeshTopology : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class PolymeshTopology _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class PolymeshTopology : IDisposable ``` |

# Remarks

Topology of a polymesh consists of a number of points and triangular facets formed by the points. Each facet is determined by three indices to the array of points. A polymesh may have UV coordinates assigned, and always has at least one normal associated. There may be more than one normal available for a non-planar polymesh; there may be as many normals as there are either facets or points in the polymesh. The DistributionOfNormals property indicates how normals are distributed along the polymesh.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB PolymeshTopology

# See Also

PolymeshTopology Members

Autodesk.Revit.DB Namespace

#### PanelId Property

---

|  |
| --- |
| AnalyticalOpening Class   See Also |

ElementId of the AnalyticalPanel parent.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public ElementId PanelId { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property PanelId As ElementId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ PanelId { 	ElementId^ get (); } ``` |

# See Also

AnalyticalOpening Class

Autodesk.Revit.DB.Structure Namespace

#### Set(FieldType) Method (Field, FieldType)

---

|  |
| --- |
| Entity Class   See Also |

Stores the value of the field in the entity.

**Namespace:**   Autodesk.Revit.DB.ExtensibleStorage
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public void Set<FieldType>( 	Field field, 	FieldType value ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub Set(Of FieldType) ( _ 	field As Field, _ 	value As FieldType _ ) ``` |

| Visual C++ |
| --- |
| ``` public: generic<typename FieldType> void Set( 	Field^ field,  	FieldType value ) ``` |

#### Parameters

field
:   Type:  Autodesk.Revit.DB.ExtensibleStorage Field
     The field to update.

value
:   Type:   FieldType

# Type Parameters

FieldType
:   The type of the field

# Remarks

The template parameter must match the type of the field (specified when creating the Schema) exactly; this method does not perform data type conversions. The types for containers are IList for arrays and IDictionary for maps.

Note that when string values are specified as map keys, they are case-insensitive.

This method only modifies your copy of the Entity. Store the Entity in an element or another Entity to save the new value. Write access check is not performed on each call to Set. Instead, write access is checked when you try to save the Entity in an Element or another Entity.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was NULL |
| Autodesk.Revit.Exceptions InvalidOperationException | The Field belongs to a different Schema from this Entity, or this Entity is invalid. |
| Autodesk.Revit.Exceptions ArgumentException | Requested type does not match the field type. |
| Autodesk.Revit.Exceptions ArgumentException | For floating-point fields, use the overload taking a ForgeTypeId parameter. |
| Autodesk.Revit.Exceptions ArgumentException | This field's subschema prevents writing. |
| Autodesk.Revit.Exceptions ArgumentException | Invalid floating-point value. |
| Autodesk.Revit.Exceptions ArgumentException | String is too long; exceeds max length of 16mb characters. |

# See Also

Entity Class

Set Overload

Autodesk.Revit.DB.ExtensibleStorage Namespace

#### Initialize Method

---

|  |
| --- |
| ApplicationEntryPoint Class   See Also |

For Revit Macros internal use only.

**Namespace:**   Autodesk.Revit.DB.Macros
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public void Initialize( 	Object obj, 	string addinFolder ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub Initialize ( _ 	obj As Object, _ 	addinFolder As String _ ) ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Initialize( 	Object^ obj,  	String^ addinFolder ) sealed ``` |

#### Parameters

obj
:   Type:  System Object

addinFolder
:   Type:  System String

#### Implements

 IEntryPoint Initialize(Object, String)

# See Also

ApplicationEntryPoint Class

Autodesk.Revit.DB.Macros Namespace

#### IsIntersectorValidForCreation Method

---

|  |
| --- |
| DividedPath Class   See Also |

This returns true if the intersector is an element that can be used to intersect with a newly created divided path.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public static bool IsIntersectorValidForCreation( 	Document document, 	ElementId intersector ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsIntersectorValidForCreation ( _ 	document As Document, _ 	intersector As ElementId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsIntersectorValidForCreation( 	Document^ document,  	ElementId^ intersector ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document.

intersector
:   Type:  Autodesk.Revit.DB ElementId
     The intersector.

#### Return Value

True if the reference can be used to create a divided path, false otherwise.

# Remarks

Intersectors can be curve elements, datum planes, or divided paths. This function is should not be used to validate the input to SetIntersectors() because it does not check for self intersection of any other circular dependencies between intersectors. Use isIntersectorValidForDividedPath() instead.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

DividedPath Class

Autodesk.Revit.DB Namespace

#### RebarManyLoopsError Property

---

|  |
| --- |
| BuiltInFailures SketchFailures Class   See Also |

Rebar Sketch contains more than one loop. Can't create Rebar.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId RebarManyLoopsError { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RebarManyLoopsError As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ RebarManyLoopsError { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures SketchFailures Class

Autodesk.Revit.DB Namespace

#### WoodLatewoodRatio Property

---

|  |
| --- |
| AdvancedWood Class   See Also |

The property labeled "Percentage of latewood in each ring" from the "AdvancedWood" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string WoodLatewoodRatio { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property WoodLatewoodRatio As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ WoodLatewoodRatio { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyDouble".

# See Also

AdvancedWood Class

Autodesk.Revit.DB.Visual Namespace

#### InvalidLocationLineJustificationFailure Property

---

|  |
| --- |
| BuiltInFailures StairRampFailures Class   See Also |

Modify the location justification to a invalid value.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId InvalidLocationLineJustificationFailure { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property InvalidLocationLineJustificationFailure As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ InvalidLocationLineJustificationFailure { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures StairRampFailures Class

Autodesk.Revit.DB Namespace

#### StairsRailingShape Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Rail Shape"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StairsRailingShape { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairsRailingShape As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StairsRailingShape { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### DocumentSynchronizedWithCentralEventArgs Class

---

|  |
| --- |
| Members   See Also |

The event arguments used by the DocumentSynchronizedWithCentralEventArgs event.

**Namespace:**   Autodesk.Revit.DB.Events
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2010

# Syntax

| C# |
| --- |
| ``` public class DocumentSynchronizedWithCentralEventArgs : RevitAPIPostDocEventArgs ``` |

| Visual Basic |
| --- |
| ``` Public Class DocumentSynchronizedWithCentralEventArgs _ 	Inherits RevitAPIPostDocEventArgs ``` |

| Visual C++ |
| --- |
| ``` public ref class DocumentSynchronizedWithCentralEventArgs : public RevitAPIPostDocEventArgs ``` |

# Inheritance Hierarchy

System Object
  System EventArgs
  Autodesk.Revit.DB.Events RevitAPIEventArgs
  Autodesk.Revit.DB.Events RevitAPIPostEventArgs
  Autodesk.Revit.DB.Events RevitAPIPostDocEventArgs
  Autodesk.Revit.DB.Events DocumentSynchronizedWithCentralEventArgs

# See Also

DocumentSynchronizedWithCentralEventArgs Members

Autodesk.Revit.DB.Events Namespace

#### RebarStandardHookBendDiameter Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Standard Hook Bend Diameter"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RebarStandardHookBendDiameter { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RebarStandardHookBendDiameter As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RebarStandardHookBendDiameter { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsValidType Method

---

|  |
| --- |
| AlignmentStationLabel Class   See Also |

Checks if the type is a valid alignment station label type.

**Namespace:**   Autodesk.Revit.DB.Infrastructure
  **Assembly:**   Autodesk.CivilAlignments.DBApplication  (in Autodesk.CivilAlignments.DBApplication.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2021.1

# Syntax

| C# |
| --- |
| ``` public static bool IsValidType( 	Element type ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsValidType ( _ 	type As Element _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsValidType( 	Element^ type ) ``` |

#### Parameters

type
:   Type:  Autodesk.Revit.DB Element
     The element type to validate.

# Remarks

Can be used for finding or types to be set to  TypeId  when creating alignment label sets with  Create(Alignment, View, AlignmentStationLabelOptions)  ; or types to be set to  TypeId  when creating alignment labels with  CreateSet(Alignment, View, AlignmentStationLabelSetOptions)  .

# See Also

AlignmentStationLabel Class

Autodesk.Revit.DB.Infrastructure Namespace

#### HemisphericalLightDistribution Class

---

|  |
| --- |
| Members   See Also |

This class encapsulates a hemispherical light distribution.

**Namespace:**   Autodesk.Revit.DB.Lighting
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public class HemisphericalLightDistribution : LightDistribution ``` |

| Visual Basic |
| --- |
| ``` Public Class HemisphericalLightDistribution _ 	Inherits LightDistribution ``` |

| Visual C++ |
| --- |
| ``` public ref class HemisphericalLightDistribution : public LightDistribution ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.Lighting LightDistribution
  Autodesk.Revit.DB.Lighting HemisphericalLightDistribution

# See Also

HemisphericalLightDistribution Members

Autodesk.Revit.DB.Lighting Namespace

#### ServiceType Enumeration

---

|  |
| --- |
| See Also |

This enumeration is used for specifying the most predominant service for the building or space.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public enum ServiceType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ServiceType ``` |

| Visual C++ |
| --- |
| ``` public enum class ServiceType ``` |

# Members

| Member name | Description |
| --- | --- |
| kNoServiceType | Service Type is NoServiceType. |
| kCentralHeatingRadiators | Service Type is CentralHeatingRadiators. |
| kCentralHeatingConvectors | Service Type is CentralHeatingConvectors. |
| kCentralHeatingRadiantFloor | Service Type is CentralHeatingRadiantFloor. |
| kCentralHeatingHotAir | Service Type is CentralHeatingHotAir. |
| kOtherRoomHeater | Service Type is OtherRoomHeater. |
| kRadiantHeaterFlue | Service Type is RadiantHeaterFlue. |
| kRadiantHeaterNoFlue | Service Type is RadiantHeaterNoFlue. |
| kRadiantHeaterMultiburner | Service Type is RadiantHeaterMultiburner. |
| kForcedConvectionHeaterFlue | Service Type is ForcedConvectionHeaterFlue. |
| kForcedConvectionHeaterNoFlue | Service Type is ForcedConvectionHeaterNoFlue. |
| kVAVSingleDuct | Service Type is VAVSingleDuct. |
| kVAVDualDuct | Service Type is VAVDualDuct. |
| kVAVIndoorPackagedCabinet | Service Type is VAVIndoorPackagedCabinet. |
| kVAVTerminalReheat | Service Type is VAVTerminalReheat. |
| kFanCoilSystem | Service Type is FanCoilSystem. |
| kInductionSystem | Service Type is InductionSystem. |
| kConstantVolumeFixedOA | Service Type is ConstantVolumeFixedOA. |
| kConstantVolumeVariableOA | Service Type is ConstantVolumeVariableOA. |
| kConstantVolumeTerminalReheat | Service Type is ConstantVolumeTerminalReheat. |
| kMultizoneHotDeckColdDeck | Service Type is MultizoneHotDeckColdDeck. |
| kConstantVolumeDualDuct | Service Type is ConstantVolumeDualDuct. |
| kRadiantCooledCeilings | Service Type is RadiantCooledCeilings. |
| kActiveChilledBeams | Service Type is ActiveChilledBeams. |
| kWaterLoopHeatPump | Service Type is WaterLoopHeatPump. |
| kVariableRefrigerantFlow | Service Type is VariableRefrigerantFlow. |
| kSplitSystemsWithNaturalVentilation | Service Type is SplitSystemsWithNaturalVentilation. |
| kSplitSystemsWithMechanicalVentilation | Service Type is SplitSystemsWithMechanicalVentilation. |
| kSplitSystemsWithMechanicalVentilationWithCooling | Service Type is SplitSystemsWithMechanicalVentilationWithCooling. |

# Remarks

This enumerated list corresponds to the serviceType attribute in the gbXML (Green Building XML) schema and is primarily used for energy analysis.

# See Also

Autodesk.Revit.DB Namespace

#### AsInteger Method

---

|  |
| --- |
| IFCData Class   See Also |

Gets storage value as integer when its PrimitiveType is integer.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public int AsInteger() ``` |

| Visual Basic |
| --- |
| ``` Public Function AsInteger As Integer ``` |

| Visual C++ |
| --- |
| ``` public: int AsInteger() ``` |

#### Return Value

The int value.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InapplicableDataException | The primitive type is not integer. |

# See Also

IFCData Class

Autodesk.Revit.DB.IFC Namespace

#### GetHookPlaneNormalForBarIdx Method

---

|  |
| --- |
| RebarUpdateCurvesData Class   See Also |

Returns the normal of plane in which the hook at end of bar with index barPositionIndex that is currently in Rebar.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public XYZ GetHookPlaneNormalForBarIdx( 	int end, 	int barPositionIndex ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetHookPlaneNormalForBarIdx ( _ 	end As Integer, _ 	barPositionIndex As Integer _ ) As XYZ ``` |

| Visual C++ |
| --- |
| ``` public: XYZ^ GetHookPlaneNormalForBarIdx( 	int end,  	int barPositionIndex ) ``` |

#### Parameters

end
:   Type:  System Int32
     The end of bar. Should be 0 for start or 1 for end.

barPositionIndex
:   Type:  System Int32
     An index between 0 and (GetNumberOfBars()-1).

#### Return Value

The normal of plane in which the hook at end of bar with index barPositionIndex that is currently in Rebar.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | barPositionIndex is not in the range [ 0, GetNumberOfBars()-1 ]. -or- Invalid end. |

# See Also

RebarUpdateCurvesData Class

Autodesk.Revit.DB.Structure Namespace

#### InvalidClosedLoopsForFaceSplit Property

---

|  |
| --- |
| BuiltInFailures FaceSplitterFailures Class   See Also |

The closed loop used to split the face must lie completely within the face and cannot intersect or overlap any of the face's edges. To split a face at its border, use an open loop that ends on the boundary of the face.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId InvalidClosedLoopsForFaceSplit { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property InvalidClosedLoopsForFaceSplit As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ InvalidClosedLoopsForFaceSplit { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures FaceSplitterFailures Class

Autodesk.Revit.DB Namespace

#### FindAssociatedPlanViewId Method

---

|  |
| --- |
| Level Class   See Also |

Finds the id of the first available associated floor or structural plan view associated with this level.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public ElementId FindAssociatedPlanViewId() ``` |

| Visual Basic |
| --- |
| ``` Public Function FindAssociatedPlanViewId As ElementId ``` |

| Visual C++ |
| --- |
| ``` public: ElementId^ FindAssociatedPlanViewId() ``` |

# Remarks

The view id returned is determined by the same rules associated with the Revit tool "Go to Floor Plan". Many levels may actually have more than one associated floor plan id and this routine will only return the first one found. If no associated view is found, InvalidElementId is returned.

# See Also

Level Class

Autodesk.Revit.DB Namespace

#### MillimetersOfMercury Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Millimeters of mercury.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId MillimetersOfMercury { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MillimetersOfMercury As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ MillimetersOfMercury { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### KilogramsPerSecond Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Kilograms per second.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId KilogramsPerSecond { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property KilogramsPerSecond As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ KilogramsPerSecond { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### RbsFpSprinklerPressureClassParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Pressure Class"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsFpSprinklerPressureClassParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsFpSprinklerPressureClassParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsFpSprinklerPressureClassParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| IndexPrimitive Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB.DirectContext3D
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

IndexPrimitive Class

Autodesk.Revit.DB.DirectContext3D Namespace

#### DoesBarExistAtPosition Method

---

|  |
| --- |
| RebarContainerItem Class   See Also |

Checks whether a bar exists at the specified position.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public bool DoesBarExistAtPosition( 	int barPosition ) ``` |

| Visual Basic |
| --- |
| ``` Public Function DoesBarExistAtPosition ( _ 	barPosition As Integer _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool DoesBarExistAtPosition( 	int barPosition ) ``` |

#### Parameters

barPosition
:   Type:  System Int32
     A bar position index between 0 and NumberOfBarPositions-1.

# Remarks

Returns true, unless the bar position is the first or last in the set and it is suppressed by IncludeFirstBar or IncludeLastBar.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | barPosition is not in the range [ 0, NumberOfBarPositions-1 ]. |

# See Also

RebarContainerItem Class

Autodesk.Revit.DB.Structure Namespace

#### AlignmentStationLabelOptions Constructor

---

|  |
| --- |
| AlignmentStationLabelOptions Class   See Also |

Creates an object with default values.

**Namespace:**   Autodesk.Revit.DB.Infrastructure
  **Assembly:**   Autodesk.CivilAlignments.DBApplication  (in Autodesk.CivilAlignments.DBApplication.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2021.1

# Syntax

| C# |
| --- |
| ``` public AlignmentStationLabelOptions( 	double station ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	station As Double _ ) ``` |

| Visual C++ |
| --- |
| ``` public: AlignmentStationLabelOptions( 	double station ) ``` |

#### Parameters

station
:   Type:  System Double
     The station at which the label will be placed.

# See Also

AlignmentStationLabelOptions Class

Autodesk.Revit.DB.Infrastructure Namespace

#### RebarSystemNumberOfLinesTopDir2Generic Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Top/Exterior Minor Number Of Lines"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RebarSystemNumberOfLinesTopDir2Generic { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RebarSystemNumberOfLinesTopDir2Generic As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RebarSystemNumberOfLinesTopDir2Generic { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Enabled Property

---

|  |
| --- |
| RibbonPanel Class   See Also |

Gets or sets a value indicating whether the RibbonPanel can respond to user interaction.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool Enabled { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Enabled As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool Enabled { 	bool get (); 	void set (bool value); } ``` |

#### Field Value

True if the panel allows interaction, false if the panel disallows interaction with all the controls it contains.

# See Also

RibbonPanel Class

Autodesk.Revit.UI Namespace

#### HasElevationProfile Method

---

|  |
| --- |
| ExporterIFCUtils Class   See Also |

Identifies if the wall has a sketched elevation profile.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public static bool HasElevationProfile( 	Wall pVWall ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function HasElevationProfile ( _ 	pVWall As Wall _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool HasElevationProfile( 	Wall^ pVWall ) ``` |

#### Parameters

pVWall
:   Type:  Autodesk.Revit.DB Wall
     The wall.

#### Return Value

True if the wall has a sketch elevation profile, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ExporterIFCUtils Class

Autodesk.Revit.DB.IFC Namespace

#### HvacEnergy Property

---

|  |
| --- |
| SpecTypeId Class   See Also |

Energy, in discipline Energy.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId HvacEnergy { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property HvacEnergy As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ HvacEnergy { 	ForgeTypeId^ get (); } ``` |

# See Also

SpecTypeId Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| ViewCropRegionShapeManager Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

ViewCropRegionShapeManager Class

Autodesk.Revit.DB Namespace

#### TextureLinkTextureTransforms Property

---

|  |
| --- |
| Wave Class   See Also |

The property labeled "Link Transforms" from the "Wave" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string TextureLinkTextureTransforms { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TextureLinkTextureTransforms As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ TextureLinkTextureTransforms { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyBoolean".

# See Also

Wave Class

Autodesk.Revit.DB.Visual Namespace

#### RebarSystemActiveBackDirn1 Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Interior Major Direction"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RebarSystemActiveBackDirn1 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RebarSystemActiveBackDirn1 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RebarSystemActiveBackDirn1 { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### DecimalSheetLength Property

---

|  |
| --- |
| SpecTypeId Class   See Also |

Decimal Sheet Length, in discipline Common.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId DecimalSheetLength { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DecimalSheetLength As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ DecimalSheetLength { 	ForgeTypeId^ get (); } ``` |

# See Also

SpecTypeId Class

Autodesk.Revit.DB Namespace

#### ActiveAddInId Property

---

|  |
| --- |
| UIApplication Class   See Also |

Get current active external application or external command id.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public AddInId ActiveAddInId { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property ActiveAddInId As AddInId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property AddInId^ ActiveAddInId { 	AddInId^ get (); } ``` |

# See Also

UIApplication Class

Autodesk.Revit.UI Namespace

#### IsValidObject Property

---

|  |
| --- |
| IFCTransformSetter Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

IFCTransformSetter Class

Autodesk.Revit.DB.IFC Namespace

#### FabricationOffsetParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Middle Elevation"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId FabricationOffsetParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FabricationOffsetParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ FabricationOffsetParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Checker Class

---

|  |
| --- |
| Members   See Also |

A static class that provides access to the property names that appear in the Checker visual asset schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static class Checker ``` |

| Visual Basic |
| --- |
| ``` Public NotInheritable Class Checker ``` |

| Visual C++ |
| --- |
| ``` public ref class Checker abstract sealed ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.Visual Checker

# See Also

Checker Members

Autodesk.Revit.DB.Visual Namespace

#### IsFromLocalPath Method

---

|  |
| --- |
| RevitLinkType Class   See Also |

Checks whether the Revit link uses a local path, such as a hard drive.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public bool IsFromLocalPath() ``` |

| Visual Basic |
| --- |
| ``` Public Function IsFromLocalPath As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsFromLocalPath() ``` |

#### Return Value

Returns true if the Revit link is from a local drive.

# See Also

RevitLinkType Class

Autodesk.Revit.DB Namespace

#### StructuralDisplayInHiddenViewsColumn Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Display in Hidden Views"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StructuralDisplayInHiddenViewsColumn { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StructuralDisplayInHiddenViewsColumn As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StructuralDisplayInHiddenViewsColumn { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### TemperatureRatings Property

---

|  |
| --- |
| WireMaterialType Class   See Also |

Get all temperature rating type definitions defined in this wire material type.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public TemperatureRatingTypeSet TemperatureRatings { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property TemperatureRatings As TemperatureRatingTypeSet 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property TemperatureRatingTypeSet^ TemperatureRatings { 	TemperatureRatingTypeSet^ get (); } ``` |

# See Also

WireMaterialType Class

Autodesk.Revit.DB.Electrical Namespace

#### ContainsKey Method

---

|  |
| --- |
| ExportLinetypeTable Class   See Also |

Checks whether a pattern key exists in the table.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public bool ContainsKey( 	ExportLinetypeKey exportLinetypeKey ) ``` |

| Visual Basic |
| --- |
| ``` Public Function ContainsKey ( _ 	exportLinetypeKey As ExportLinetypeKey _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool ContainsKey( 	ExportLinetypeKey^ exportLinetypeKey ) ``` |

#### Parameters

exportLinetypeKey
:   Type:  Autodesk.Revit.DB ExportLinetypeKey
     The export line type key.

#### Return Value

True if the line type exists in the table.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ExportLinetypeTable Class

Autodesk.Revit.DB Namespace

#### SpaceSet Class

---

|  |
| --- |
| Members   See Also |

A set that can contain any type of object.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class SpaceSet : APIObject, IEnumerable ``` |

| Visual Basic |
| --- |
| ``` Public Class SpaceSet _ 	Inherits APIObject _ 	Implements IEnumerable ``` |

| Visual C++ |
| --- |
| ``` public ref class SpaceSet : public APIObject,  	IEnumerable ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB APIObject
  Autodesk.Revit.DB.Mechanical SpaceSet

# See Also

SpaceSet Members

Autodesk.Revit.DB.Mechanical Namespace

#### StructuralSectionGeneralH Constructor

---

|  |
| --- |
| StructuralSectionGeneralH Class   See Also |

Creates a new instance of Rectangular Pipe shape.

**Namespace:**   Autodesk.Revit.DB.Structure.StructuralSections
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public StructuralSectionGeneralH( 	double width, 	double height, 	double wallNominalThickness, 	double wallDesignThickness, 	double innerFillet, 	double outerFillet, 	double centroidHorizontal, 	double centroidVertical, 	StructuralSectionAnalysisParams analysisParams ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	width As Double, _ 	height As Double, _ 	wallNominalThickness As Double, _ 	wallDesignThickness As Double, _ 	innerFillet As Double, _ 	outerFillet As Double, _ 	centroidHorizontal As Double, _ 	centroidVertical As Double, _ 	analysisParams As StructuralSectionAnalysisParams _ ) ``` |

| Visual C++ |
| --- |
| ``` public: StructuralSectionGeneralH( 	double width,  	double height,  	double wallNominalThickness,  	double wallDesignThickness,  	double innerFillet,  	double outerFillet,  	double centroidHorizontal,  	double centroidVertical,  	StructuralSectionAnalysisParams^ analysisParams ) ``` |

#### Parameters

width
:   Type:  System Double
     Section width.

height
:   Type:  System Double
     Section height, depth.

wallNominalThickness
:   Type:  System Double
     Represents wall nominal thickness of rectangle.

wallDesignThickness
:   Type:  System Double
     Represents wall design thickness of rectangle.

innerFillet
:   Type:  System Double
     Inner Fillet - Corner fillet inner radius.

outerFillet
:   Type:  System Double
     Outer Fillet - Corner fillet outer radius.

centroidHorizontal
:   Type:  System Double
     Distance from centroid to the left extremites along horizontal axis.

centroidVertical
:   Type:  System Double
     Distance from centroid to the upper extremites along vertical axis.

analysisParams
:   Type:  Autodesk.Revit.DB.Structure.StructuralSections StructuralSectionAnalysisParams
     Common set of parameters for structural analysis.

# See Also

StructuralSectionGeneralH Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace

#### FindByName Method

---

|  |
| --- |
| AssetProperties Class   See Also |

Gets the property with the given name.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public AssetProperty FindByName( 	string name ) ``` |

| Visual Basic |
| --- |
| ``` Public Function FindByName ( _ 	name As String _ ) As AssetProperty ``` |

| Visual C++ |
| --- |
| ``` public: AssetProperty^ FindByName( 	String^ name ) ``` |

#### Parameters

name
:   Type:  System String
     Name of the property.

#### Return Value

The property with the specified name.

# Remarks

FindByName will not visit the properties of any connected asset on any of the properties.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

AssetProperties Class

Autodesk.Revit.DB.Visual Namespace

#### Clear Method

---

|  |
| --- |
| SpaceSet Class   See Also |

Removes every item from the set, rendering it empty.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual void Clear() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Sub Clear ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Clear() ``` |

# See Also

SpaceSet Class

Autodesk.Revit.DB.Mechanical Namespace

#### DefinitionGroups Class

---

|  |
| --- |
| Members   See Also |

A specialized set of definition groups that allows creation of new groups.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class DefinitionGroups : IEnumerable<DefinitionGroup>,  	IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class DefinitionGroups _ 	Implements IEnumerable(Of DefinitionGroup), IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class DefinitionGroups : IEnumerable<DefinitionGroup^>,  	IDisposable ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB DefinitionGroups

# See Also

DefinitionGroups Members

Autodesk.Revit.DB Namespace

#### ParameterMap Class

---

|  |
| --- |
| Members   See Also |

A map that can contain a mapping of a parameter name (a String) to a parameter.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class ParameterMap : APIObject,  	IEnumerable ``` |

| Visual Basic |
| --- |
| ``` Public Class ParameterMap _ 	Inherits APIObject _ 	Implements IEnumerable ``` |

| Visual C++ |
| --- |
| ``` public ref class ParameterMap : public APIObject,  	IEnumerable ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB APIObject
  Autodesk.Revit.DB ParameterMap

# See Also

ParameterMap Members

Autodesk.Revit.DB Namespace

#### MoveParameterDownOrder Method

---

|  |
| --- |
| GlobalParametersManager Class   See Also |

Moves given paramerer Down in the current order.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public static bool MoveParameterDownOrder( 	Document document, 	ElementId parameterId ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function MoveParameterDownOrder ( _ 	document As Document, _ 	parameterId As ElementId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool MoveParameterDownOrder( 	Document^ document,  	ElementId^ parameterId ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     Document containing the give global parameter

parameterId
:   Type:  Autodesk.Revit.DB ElementId
     The parameter to move Down

#### Return Value

Indicates whether the parameter could be moved Down in order or not.

# Remarks

A parameter can only be moved within its parameter group, meaning that repeated moving a parameter will not push the parameter out of and into the next (in order) parameter group. When a parameter can no longer move because it is at the boundary of its group, this method returns False.

This operation has no effect on the global parameters themselves. The rearranged order is only visible in the standard Global Parameters dialog. However, the order of parameters is serialized in the document, thus available on the DB level as well.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Global parameters are not supported in the given document. A possible cause is that it is not a project document, for global parameters are not supported in Revit families. -or- The input parameterId is not of a valid global parameter of the given document. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

GlobalParametersManager Class

Autodesk.Revit.DB Namespace

#### PipeSize Property

---

|  |
| --- |
| SpecTypeId Class   See Also |

Pipe Size, in discipline Piping.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PipeSize { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PipeSize As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PipeSize { 	ForgeTypeId^ get (); } ``` |

# See Also

SpecTypeId Class

Autodesk.Revit.DB Namespace

#### Current Property

---

|  |
| --- |
| WireMaterialTypeSetIterator Class   See Also |

Retrieves the item that is the current focus of the iterator.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual Object Current { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property Current As Object 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property Object^ Current { 	Object^ get (); } ``` |

#### Implements

 IEnumerator Current

# Remarks

A new or Reset iterator must have MoveNext called on it before Current will return a valid item as per expected behavior of IEnumerator.

# See Also

WireMaterialTypeSetIterator Class

Autodesk.Revit.DB.Electrical Namespace

#### NestedFamilyTypeReference Class

---

|  |
| --- |
| Members   See Also |

A proxy element representing a nested family type.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public class NestedFamilyTypeReference : Element ``` |

| Visual Basic |
| --- |
| ``` Public Class NestedFamilyTypeReference _ 	Inherits Element ``` |

| Visual C++ |
| --- |
| ``` public ref class NestedFamilyTypeReference : public Element ``` |

# Remarks

This element represents a value of a FamilyType Parameter of a Loaded Family. Each such element corresponds to a nested FamilyType Element in the original Family Document where the family was defined.

This element stores only basic information about the nested FamilyType, such as the name of the Type, name of the Family, and a Category.

These elements are very low-level and thus bypassed by standard element filters. However, it is possible to obtain a set of applicable elements of this class for a FamilyType parameter of a family by calling  [!:Autodesk::Revit::DB::Family::GetFamilyTypeParameterValues]

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB NestedFamilyTypeReference

# See Also

NestedFamilyTypeReference Members

Autodesk.Revit.DB Namespace

#### SetProjectPosition Method

---

|  |
| --- |
| ProjectLocation Class   See Also |

Sets the coordinates of a point in the ProjectLocation's coordinate system.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public void SetProjectPosition( 	XYZ point, 	ProjectPosition position ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetProjectPosition ( _ 	point As XYZ, _ 	position As ProjectPosition _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetProjectPosition( 	XYZ^ point,  	ProjectPosition^ position ) ``` |

#### Parameters

point
:   Type:  Autodesk.Revit.DB XYZ

position
:   Type:  Autodesk.Revit.DB ProjectPosition

# Remarks

When setting this value, the transformations applied to the location are modified such that the passed point becomes the specified North/South, East/West and Elevation, and the coordinate transform will have the designated angular rotation. This is similar to the Revit command "Specify Coordinates at Point".

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | Unable to use the project position's transform to calculate the point. |

# See Also

ProjectLocation Class

Autodesk.Revit.DB Namespace

#### UnhideElements Method

---

|  |
| --- |
| View Class   See Also |

Sets the elements to be shown in the given view if they are currently hidden.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void UnhideElements( 	ICollection<ElementId> elementIdSet ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub UnhideElements ( _ 	elementIdSet As ICollection(Of ElementId) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void UnhideElements( 	ICollection<ElementId^>^ elementIdSet ) ``` |

#### Parameters

elementIdSet
:   Type:  System.Collections.Generic ICollection   ElementId
     A set of ElementIds to be unhidden.

# Remarks

This change is permanent until the elements are hidden again. All elements in the set must be currently hidden. An application can check this with  IsHidden(View)  .

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when argument is    a null reference (  Nothing  in Visual Basic)  . |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when the set of elements to be unhidden is empty or one of the elements can not be unhidden. |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when document regeneration failed. |

# See Also

View Class

Autodesk.Revit.DB Namespace

#### RailCurveTooShort Property

---

|  |
| --- |
| BuiltInFailures StairRampFailures Class   See Also |

Curve in rail sketch is too short for rail creation and ignored.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId RailCurveTooShort { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RailCurveTooShort As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ RailCurveTooShort { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures StairRampFailures Class

Autodesk.Revit.DB Namespace

#### ImageInstance Class

---

|  |
| --- |
| Members   See Also |

An element that represents an instance of an image placed in a view

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2020

# Syntax

| C# |
| --- |
| ``` public class ImageInstance : Element ``` |

| Visual Basic |
| --- |
| ``` Public Class ImageInstance _ 	Inherits Element ``` |

| Visual C++ |
| --- |
| ``` public ref class ImageInstance : public Element ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB ImageInstance

# See Also

ImageInstance Members

Autodesk.Revit.DB Namespace

#### SetAttribute Method (String, IList(String))

---

|  |
| --- |
| IFCAnyHandle Class   See Also |

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void SetAttribute( 	string name, 	IList<string> values ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetAttribute ( _ 	name As String, _ 	values As IList(Of String) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetAttribute( 	String^ name,  	IList<String^>^ values ) ``` |

#### Parameters

name
:   Type:  System String

values
:   Type:  System.Collections.Generic IList   String

# See Also

IFCAnyHandle Class

SetAttribute Overload

Autodesk.Revit.DB.IFC Namespace

#### PickSupport Method

---

|  |
| --- |
| SlabShapeEditor Class   See Also |

Picks an element to support the slab. This method will define split lines and create constant bearing lines for the slab.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void PickSupport( 	Line gLine ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub PickSupport ( _ 	gLine As Line _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void PickSupport( 	Line^ gLine ) ``` |

#### Parameters

gLine
:   Type:  Autodesk.Revit.DB Line
     A line from a support element such as a beam.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when the input line is    a null reference (  Nothing  in Visual Basic)  . |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when the input line is invalid. |

# See Also

SlabShapeEditor Class

Autodesk.Revit.DB Namespace

#### StructuralFoundationLength Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Length"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StructuralFoundationLength { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StructuralFoundationLength As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StructuralFoundationLength { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### TilePerColumn Property

---

|  |
| --- |
| Tile Class   See Also |

The property labeled "Every" from the "Tile" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string TilePerColumn { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TilePerColumn As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ TilePerColumn { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyInteger" within the range of "0, 50".

# See Also

Tile Class

Autodesk.Revit.DB.Visual Namespace

#### FormulaEditing Event

---

|  |
| --- |
| UIApplication Class   See Also |

Subscribe to the FormulaEditing event to be notified when the edit formula button has been clicked.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 19.0.0.0 (19.0.0.405)

# Syntax

| C# |
| --- |
| ``` public event EventHandler<FormulaEditingEventArgs> FormulaEditing ``` |

| Visual Basic |
| --- |
| ``` Public Event FormulaEditing As EventHandler(Of FormulaEditingEventArgs) ``` |

| Visual C++ |
| --- |
| ``` public:  event EventHandler<FormulaEditingEventArgs^>^ FormulaEditing { 	void add (EventHandler<FormulaEditingEventArgs^>^ value); 	void remove (EventHandler<FormulaEditingEventArgs^>^ value); } ``` |

# See Also

UIApplication Class

Autodesk.Revit.UI Namespace

#### RebarUpdateCurvesData Class

---

|  |
| --- |
| Members   See Also |

Class holding the information needed to calculate the rebar curves.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public class RebarUpdateCurvesData : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class RebarUpdateCurvesData _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class RebarUpdateCurvesData : IDisposable ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.Structure RebarUpdateCurvesData

# See Also

RebarUpdateCurvesData Members

Autodesk.Revit.DB.Structure Namespace

#### InputFormat Property

---

|  |
| --- |
| ShapeImporter Class   See Also |

The format of the incoming data.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public ShapeImporterSourceFormat InputFormat { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property InputFormat As ShapeImporterSourceFormat 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property ShapeImporterSourceFormat InputFormat { 	ShapeImporterSourceFormat get (); 	void set (ShapeImporterSourceFormat value); } ``` |

# Remarks

If this option is set to Auto (the default), the file name extension will be used to determine the input format. That covers most file-based data import workflows. Specify the input format explicitly to perform an additional sanity check or if you are using a non-standard file extension.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also

ShapeImporter Class

Autodesk.Revit.DB Namespace

#### DimLeaderType Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Leader Type"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId DimLeaderType { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DimLeaderType As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ DimLeaderType { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### EdgeArray Constructor

---

|  |
| --- |
| EdgeArray Class   See Also |

Initializes a new instance of the  EdgeArray  class

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public EdgeArray() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: EdgeArray() ``` |

# See Also

EdgeArray Class

Autodesk.Revit.DB Namespace

#### PickElementsByRectangle Method (String)

---

|  |
| --- |
| Selection Class   Example   See Also |

Prompts the user to select multiple elements by drawing a rectangle while showing a custom status prompt string.

**Namespace:**   Autodesk.Revit.UI.Selection
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public IList<Element> PickElementsByRectangle( 	string statusPrompt ) ``` |

| Visual Basic |
| --- |
| ``` Public Function PickElementsByRectangle ( _ 	statusPrompt As String _ ) As IList(Of Element) ``` |

| Visual C++ |
| --- |
| ``` public: IList<Element^>^ PickElementsByRectangle( 	String^ statusPrompt ) ``` |

#### Parameters

statusPrompt
:   Type:  System String
     The message shown on the status bar.

#### Return Value

A collection of elements selected by the user.

Note: if the user cancels the operation (for example, through ESC), the method will throw an OperationCanceledException instance.

# Remarks

Revit users will be permitted to manipulate the Revit view (zooming, panning, and rotating the view), but will not be permitted to click other items in the Revit user interface. Users are not permitted to switch the active view, close the active document or Revit application in the pick session, otherwise an exception will be thrown.

The selection will not be automatically added to the active selection buffer.

Note: this method must not be called during dynamic update, otherwise ForbiddenForDynamicUpdateException will be thrown.

# Examples

 Copy  C#

```
// Use the rectangle picking tool to identify model elements to select.
IList<Element> pickedElements = uidoc.Selection.PickElementsByRectangle("Select by rectangle");
if (pickedElements.Count > 0)
{
    // Collect Ids of all picked elements
    IList<ElementId> idsToSelect = new List<ElementId>(pickedElements.Count);
    foreach (Element element in pickedElements)
    {
        idsToSelect.Add(element.Id);
    }

    // Update the current selection
    uidoc.Selection.SetElementIds(idsToSelect);
    TaskDialog.Show("Revit", string.Format("{0} elements added to Selection.", idsToSelect.Count));
}
```

 Copy  VB.NET

```
' Use the rectangle picking tool to identify model elements to select.
Dim pickedElements As IList(Of Element) = uidoc.Selection.PickElementsByRectangle("Select by rectangle")
If pickedElements.Count > 0 Then
    ' Collect Ids of all picked elements
    Dim idsToSelect As IList(Of ElementId) = New List(Of ElementId)(pickedElements.Count)
    For Each element As Element In pickedElements
        idsToSelect.Add(element.Id)
    Next

    ' Update the current selection
    uidoc.Selection.SetElementIds(idsToSelect)
    TaskDialog.Show("Revit", String.Format("{0} elements added to Selection.", idsToSelect.Count))
End If
```

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when the statusPrompt is    a null reference (  Nothing  in Visual Basic)  . |
| Autodesk.Revit.Exceptions OperationCanceledException | Thrown when the Revit user cancelled this operation. Thrown when the Revit user tried to switch the active view, close the active document or Revit application when responding to this mode. |
| Autodesk.Revit.Exceptions ForbiddenForDynamicUpdateException | Thrown if this method is called during dynamic update. |

# See Also

Selection Class

PickElementsByRectangle Overload

Autodesk.Revit.UI.Selection Namespace

#### DesignSupplyAirflow Property

---

|  |
| --- |
| Space Class   See Also |

Get or set the Specified Supply Airflow of the Space.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public double DesignSupplyAirflow { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property DesignSupplyAirflow As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double DesignSupplyAirflow { 	double get (); 	void set (double value); } ``` |

# Remarks

This property is used to get or set the Specified Supply Airflow (Unit: CFM) of the Space.

# See Also

Space Class

Autodesk.Revit.DB.Mechanical Namespace

#### AnalyticalMemberInstability Property

---

|  |
| --- |
| BuiltInFailures AnalyticalModelFailures Class   See Also |

Possible Member Instability, based on Release Conditions

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId AnalyticalMemberInstability { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property AnalyticalMemberInstability As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ AnalyticalMemberInstability { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures AnalyticalModelFailures Class

Autodesk.Revit.DB Namespace

#### ConnectToUpstreamNode Method

---

|  |
| --- |
| ElectricalAnalyticalNode Class   See Also |

Connects to upstream node.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public void ConnectToUpstreamNode( 	ElementId upstreamNodeId ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub ConnectToUpstreamNode ( _ 	upstreamNodeId As ElementId _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void ConnectToUpstreamNode( 	ElementId^ upstreamNodeId ) ``` |

#### Parameters

upstreamNodeId
:   Type:  Autodesk.Revit.DB ElementId
     The upstream node id.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The id is not an analytical distribution node id. -or- The analytical distribution node is full of downstream nodes. -or- The analytical distribution node can not connect to the upstream node. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | The analytical distribution node is full of upstream nodes. |

# See Also

ElectricalAnalyticalNode Class

Autodesk.Revit.DB.Electrical Namespace

#### NotAllPartsWereConvertedUnsuportedFittingOffsets Property

---

|  |
| --- |
| BuiltInFailures MEPFabricationFailures Class   See Also |

Not all parts were converted. Eccentric transitions and taps that have offsets from the center line are unsupported and cannot be converted.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId NotAllPartsWereConvertedUnsuportedFittingOffsets { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property NotAllPartsWereConvertedUnsuportedFittingOffsets As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ NotAllPartsWereConvertedUnsuportedFittingOffsets { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures MEPFabricationFailures Class

Autodesk.Revit.DB Namespace

#### TriangleInShellComponent Class

---

|  |
| --- |
| Members   See Also |

This class represents a triangle in a TriangulatedShellComponent object. The triangle is defined by its vertices, which are specified by their indices in the TriangulatedShellComponent's array of vertices.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public class TriangleInShellComponent : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class TriangleInShellComponent _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class TriangleInShellComponent : IDisposable ``` |

# Remarks

A TriangulatedShellComponent stores an array of TriangleInShellComponent objects representing the triangles of the triangulation. An external class is used because the API does not allow the use of a triple of integers. Note that a TriangleInShellComponent must only be used in the context of a single, fixed TriangulatedShellComponent.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB TriangleInShellComponent

# See Also

TriangleInShellComponent Members

Autodesk.Revit.DB Namespace

#### NameNotUnique Property

---

|  |
| --- |
| BuiltInFailures GeneralFailures Class   See Also |

The name entered is already in use. Enter a unique name.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId NameNotUnique { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property NameNotUnique As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ NameNotUnique { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures GeneralFailures Class

Autodesk.Revit.DB Namespace

#### OnShutdown Method

---

|  |
| --- |
| IEntryPoint Interface   See Also |

**Namespace:**   Autodesk.Revit.DB.Macros
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` void OnShutdown() ``` |

| Visual Basic |
| --- |
| ``` Sub OnShutdown ``` |

| Visual C++ |
| --- |
| ``` void OnShutdown() ``` |

# See Also

IEntryPoint Interface

Autodesk.Revit.DB.Macros Namespace

#### SpatialFieldMgrCurrentName Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Analysis Configuration"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SpatialFieldMgrCurrentName { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SpatialFieldMgrCurrentName As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SpatialFieldMgrCurrentName { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| ColorSelectionDialog Class   See Also |

Releases all resources used by the  ColorSelectionDialog

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

ColorSelectionDialog Class

Autodesk.Revit.UI Namespace

#### ShowDataDescription Property

---

|  |
| --- |
| AnalysisDisplayLegendSettings Class   See Also |

If true, data description is shown in the legend.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public bool ShowDataDescription { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ShowDataDescription As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool ShowDataDescription { 	bool get (); 	void set (bool value); } ``` |

# See Also

AnalysisDisplayLegendSettings Class

Autodesk.Revit.DB.Analysis Namespace

#### AddConstraintToSegment Method

---

|  |
| --- |
| RebarShapeDefinitionBySegments Class   See Also |

Add a constraint that helps determine the length of a segment.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public void AddConstraintToSegment( 	int iSegment, 	ElementId paramId, 	double constraintDirCoordX, 	double constraintDirCoordY, 	int signOfZCoordOfCrossProductOfConstraintDirBySegmentDir, 	bool measureToOutsideOfBend0, 	bool measureToOutsideOfBend1 ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub AddConstraintToSegment ( _ 	iSegment As Integer, _ 	paramId As ElementId, _ 	constraintDirCoordX As Double, _ 	constraintDirCoordY As Double, _ 	signOfZCoordOfCrossProductOfConstraintDirBySegmentDir As Integer, _ 	measureToOutsideOfBend0 As Boolean, _ 	measureToOutsideOfBend1 As Boolean _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void AddConstraintToSegment( 	int iSegment,  	ElementId^ paramId,  	double constraintDirCoordX,  	double constraintDirCoordY,  	int signOfZCoordOfCrossProductOfConstraintDirBySegmentDir,  	bool measureToOutsideOfBend0,  	bool measureToOutsideOfBend1 ) ``` |

#### Parameters

iSegment
:   Type:  System Int32
     Index of the segment (0 to NumberOfSegments - 1).

paramId
:   Type:  Autodesk.Revit.DB ElementId
     Id of a parameter to drive the constraint. To obtain the id of a shared parameter, call RebarShape.GetElementIdForExternalDefinition().

constraintDirCoordX
:   Type:  System Double
     The x-coordinate of a 2D vector specifying the constraint direction.

constraintDirCoordY
:   Type:  System Double
     The y-coordinate of a 2D vector specifying the constraint direction.

signOfZCoordOfCrossProductOfConstraintDirBySegmentDir
:   Type:  System Int32
     Legal values are 1 and -1. For a fixed-direction segment, this value is ignored. For a variable-direction segment, this value is combined with the constraint length (the nonnegative value associated with 'param') to determine the direction of the segment. For example, a segment whose direction vector lies in the upper-right quadrant of the plane, and whose x-axis projected length is A and whose y-axis projected length is B, could be created by calling: AddConstraintToSegment(iSegment, paramA, 1.0, 0.0, 1, ...) AddConstraintToSegment(iSegment, paramB, 0.0, 1.0, -1, ...)

measureToOutsideOfBend0
:   Type:  System Boolean
     Choose between two possibilities for the first reference of the length dimension. If false, the reference is at the point where the bend begins; equivalently, at the projection of the bend centerpoint onto the segment. If true, the reference is moved outward by a distance equal to the bend radius plus the bar diameter; if the bend is a right angle or greater, this is equivalent to putting the reference at the outer face of the bend.

measureToOutsideOfBend1
:   Type:  System Boolean
     Choose between two possibilities for the second reference of the length dimension.

# Remarks

The vector defined by (constraintDirCoordX, constraintDirCoordY) must have a positive dot product with the desired direction of the segment. This restriction, combined with the value of signOfZCoordOfCrossProductOfConstraintDirBySegmentDir, defines a quadrant of the plane that limits the variable-angle segment.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | iSegment is not between 0 and NumberOfSegments. -or- paramId is not the id of a shared parameter in the current document, or its unit type is not UT\_Reinforcement\_Length or UT\_Angle. -or- The length of the vector (constraintDirCoordX, constraintDirCoordY) is too close to zero. -or- signOfZCoordOfCrossProductOfConstraintDirBySegmentDir is neither -1 nor 1. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

RebarShapeDefinitionBySegments Class

Autodesk.Revit.DB.Structure Namespace

#### ExternalResourceReference Class

---

|  |
| --- |
| Members   See Also |

This class identifies an external resource provided by an IExternalResourceServer.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public class ExternalResourceReference : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class ExternalResourceReference _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class ExternalResourceReference : IDisposable ``` |

# Remarks

The class contains:

* The id of the IExternalResourceServer from which the resource was obtained.
* A (String, String) map containing information that is meaningful to the server for accessing the desired data. This could be something as simple as "4" to indicate that Revit wants option 4 from a range of several choices, or something more detailed, such as a filename or directory path.
* A String indicating the version of the resource that was most recently loaded in Revit.
* A (String, String) map containing "in session" information that is meaningful to the server, but which does not need to be saved permanently in the document on disk.

When calling an IExternalResourceServer, Revit will provide an ExternalResourceReference to identify the specific resource that Revit is using from that server. The server can then use the relevant information in the (String, String) maps to retrieve the data from the correct source.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB ExternalResourceReference

# See Also

ExternalResourceReference Members

Autodesk.Revit.DB Namespace

#### ElementType Class

---

|  |
| --- |
| Members   See Also |

Base class for all Types within Autodesk Revit.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)

# Syntax

| C# |
| --- |
| ``` public class ElementType : Element ``` |

| Visual Basic |
| --- |
| ``` Public Class ElementType _ 	Inherits Element ``` |

| Visual C++ |
| --- |
| ``` public ref class ElementType : public Element ``` |

# Remarks

Element types are usually non user visible elements that define instances. For example a wall type is a type that is not visible until an instance of the wall is created.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB ElementType
  Autodesk.Revit.DB.Analysis ConceptualConstructionType
  Autodesk.Revit.DB.Architecture ContinuousRailType
  Autodesk.Revit.DB.Architecture CutMarkType
  Autodesk.Revit.DB.Architecture RailingType
  Autodesk.Revit.DB.Architecture StairsLandingType
  Autodesk.Revit.DB.Architecture StairsPathType
  Autodesk.Revit.DB.Architecture StairsRunType
  Autodesk.Revit.DB.Architecture StairsType
  Autodesk.Revit.DB.Architecture TopographyLinkType
  Autodesk.Revit.DB AssemblyType
  Autodesk.Revit.DB BeamSystemType
  Autodesk.Revit.DB BrowserOrganization
  Autodesk.Revit.DB CADLinkType
  Autodesk.Revit.DB DimensionType
  Autodesk.Revit.DB DirectShapeType
  Autodesk.Revit.DB.Electrical DistributionSysType
  Autodesk.Revit.DB.Electrical InsulationType
  Autodesk.Revit.DB.Electrical TemperatureRatingType
  Autodesk.Revit.DB.Electrical VoltageType
  Autodesk.Revit.DB.Electrical WireMaterialType
  Autodesk.Revit.DB.Electrical WireType
  Autodesk.Revit.DB FabricationPartType
  Autodesk.Revit.DB GroupType
  Autodesk.Revit.DB HostObjAttributes
  Autodesk.Revit.DB ImageType
  Autodesk.Revit.DB InsertableObject
  Autodesk.Revit.DB LineAndTextAttrSymbol
  Autodesk.Revit.DB.Mechanical DuctInsulationType
  Autodesk.Revit.DB.Mechanical DuctLiningType
  Autodesk.Revit.DB.Mechanical MechanicalEquipmentSetType
  Autodesk.Revit.DB.Mechanical MEPBuildingConstruction
  Autodesk.Revit.DB MEPAnalyticalConnectionType
  Autodesk.Revit.DB MEPSystemType
  Autodesk.Revit.DB ModelTextType
  Autodesk.Revit.DB MultiReferenceAnnotationType
  Autodesk.Revit.DB.Plumbing FluidType
  Autodesk.Revit.DB.Plumbing PipeInsulationType
  Autodesk.Revit.DB.Plumbing PipeScheduleType
  Autodesk.Revit.DB PointCloudType
  Autodesk.Revit.DB RevitLinkType
  Autodesk.Revit.DB SiteLocation
  Autodesk.Revit.DB.Structure AnalyticalLinkType
  Autodesk.Revit.DB.Structure AreaReinforcementType
  Autodesk.Revit.DB.Structure EndTreatmentType
  Autodesk.Revit.DB.Structure FabricAreaType
  Autodesk.Revit.DB.Structure FabricSheetType
  Autodesk.Revit.DB.Structure FabricWireType
  Autodesk.Revit.DB.Structure LoadTypeBase
  Autodesk.Revit.DB.Structure PathReinforcementType
  Autodesk.Revit.DB.Structure RebarBarType
  Autodesk.Revit.DB.Structure RebarContainerType
  Autodesk.Revit.DB.Structure RebarCoverType
  Autodesk.Revit.DB.Structure RebarHookType
  Autodesk.Revit.DB.Structure RebarShape
  Autodesk.Revit.DB.Structure StructuralConnectionApprovalType
  Autodesk.Revit.DB.Structure StructuralConnectionHandlerType
  Autodesk.Revit.DB.Structure StructuralConnectionType
  Autodesk.Revit.DB TilePattern
  Autodesk.Revit.DB ViewFamilyType

# See Also

ElementType Members

Autodesk.Revit.DB Namespace

#### DuctFittingAndAccessoryConnectorData Class

---

|  |
| --- |
| Members   See Also |

The input data used by external servers for calculation of the duct fitting and duct accessory coefficient.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public class DuctFittingAndAccessoryConnectorData : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class DuctFittingAndAccessoryConnectorData _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class DuctFittingAndAccessoryConnectorData : IDisposable ``` |

# Remarks

width, height, diameter, flow, velocity pressure and connector index are input data for the calculation,

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.Mechanical DuctFittingAndAccessoryConnectorData

# See Also

DuctFittingAndAccessoryConnectorData Members

Autodesk.Revit.DB.Mechanical Namespace

#### Dispose Method

---

|  |
| --- |
| RebarHandlesData Class   See Also |

Releases all resources used by the  RebarHandlesData

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

RebarHandlesData Class

Autodesk.Revit.DB.Structure Namespace

#### IsDWGExportAvailable Method

---

|  |
| --- |
| OptionalFunctionalityUtils Class   See Also |

Checks whether the DWG Export functionality is available in the installed Revit.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static bool IsDWGExportAvailable() ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsDWGExportAvailable As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsDWGExportAvailable() ``` |

#### Return Value

True if the DWG Export functionality is available in the installed Revit.

# Remarks

DWG Export requires presence of certain modules that are optional and may not be part of the installed Revit.

# See Also

OptionalFunctionalityUtils Class

Autodesk.Revit.DB Namespace

#### MaterialAssetParamAssetLibId Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Asset library id"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId MaterialAssetParamAssetLibId { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MaterialAssetParamAssetLibId As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ MaterialAssetParamAssetLibId { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsolateElementsTemporary Method

---

|  |
| --- |
| View Class   See Also |

Set multiple elements to be temporarily isolated in the view. To isolate a group completely, you must also include all members of all groups and nested groups in your input.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public void IsolateElementsTemporary( 	ICollection<ElementId> elementIds ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub IsolateElementsTemporary ( _ 	elementIds As ICollection(Of ElementId) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void IsolateElementsTemporary( 	ICollection<ElementId^>^ elementIds ) ``` |

#### Parameters

elementIds
:   Type:  System.Collections.Generic ICollection   ElementId
     Ids of elements to be isolated.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

View Class

Autodesk.Revit.DB Namespace

#### TransferringProjectStandardsEventArgs Class

---

|  |
| --- |
| Members   See Also |

The event arguments used by the TransferringProjectStandards event.

**Namespace:**   Autodesk.Revit.UI.Events
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2017.2

# Syntax

| C# |
| --- |
| ``` public class TransferringProjectStandardsEventArgs : RevitAPIPreDocEventArgs ``` |

| Visual Basic |
| --- |
| ``` Public Class TransferringProjectStandardsEventArgs _ 	Inherits RevitAPIPreDocEventArgs ``` |

| Visual C++ |
| --- |
| ``` public ref class TransferringProjectStandardsEventArgs : public RevitAPIPreDocEventArgs ``` |

# Inheritance Hierarchy

System Object
  System EventArgs
  Autodesk.Revit.DB.Events RevitAPIEventArgs
  Autodesk.Revit.DB.Events RevitAPIPreEventArgs
  Autodesk.Revit.DB.Events RevitAPIPreDocEventArgs
  Autodesk.Revit.UI.Events TransferringProjectStandardsEventArgs

# See Also

TransferringProjectStandardsEventArgs Members

Autodesk.Revit.UI.Events Namespace

#### IsValidForMaxEdgeLength Method

---

|  |
| --- |
| OBJExportOptions Class   See Also |

Checks whether the value is allowed (is in the allowed range) for MaxEdgeLength tessellation parameter.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public static bool IsValidForMaxEdgeLength( 	double value ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsValidForMaxEdgeLength ( _ 	value As Double _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsValidForMaxEdgeLength( 	double value ) ``` |

#### Parameters

value
:   Type:  System Double
     The value to be checked.

#### Return Value

True if the value is valid for MaxEdgeLength, false otherwise.

# See Also

OBJExportOptions Class

Autodesk.Revit.DB Namespace

#### UnconnectedDevice Property

---

|  |
| --- |
| BuiltInFailures ConnectorFailures Class   See Also |

Device has an unconnected [Type Name] connector (index = [Index Number]).

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId UnconnectedDevice { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property UnconnectedDevice As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ UnconnectedDevice { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures ConnectorFailures Class

Autodesk.Revit.DB Namespace

#### SmallBendRadius Property

---

|  |
| --- |
| BuiltInFailures ElectricalFailures Class   See Also |

The value you entered for the bend radius for conduit is too small. Enter a larger value.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId SmallBendRadius { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SmallBendRadius As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ SmallBendRadius { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures ElectricalFailures Class

Autodesk.Revit.DB Namespace

#### GetObjectData Method

---

|  |
| --- |
| ArgumentException Class   See Also |

Retrieves data needed to serialize the target object.

**Namespace:**   Autodesk.Revit.Exceptions
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public override void GetObjectData( 	SerializationInfo info, 	StreamingContext context ) ``` |

| Visual Basic |
| --- |
| ``` Public Overrides Sub GetObjectData ( _ 	info As SerializationInfo, _ 	context As StreamingContext _ ) ``` |

| Visual C++ |
| --- |
| ``` public: virtual void GetObjectData( 	SerializationInfo^ info,  	StreamingContext context ) override ``` |

#### Parameters

info
:   Type:  System.Runtime.Serialization SerializationInfo
     Data needed to serialize or deserialize the object.

context
:   Type:  System.Runtime.Serialization StreamingContext
     The destination of the serialized stream.

#### Implements

 ISerializable GetObjectData(SerializationInfo, StreamingContext)
  \_Exception GetObjectData(SerializationInfo, StreamingContext)

# See Also

ArgumentException Class

Autodesk.Revit.Exceptions Namespace

#### TemperatureLossFactor Property

---

|  |
| --- |
| AdvancedLossFactor Class   See Also |

The temperature loss factor.

**Namespace:**   Autodesk.Revit.DB.Lighting
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public double TemperatureLossFactor { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property TemperatureLossFactor As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double TemperatureLossFactor { 	double get (); 	void set (double value); } ``` |

#### Field Value

The loss factor as a numerical value between 0.0 and 2.0

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: The loss factor is not valid because it is not between 0.0 and 2.0. |

# See Also

AdvancedLossFactor Class

Autodesk.Revit.DB.Lighting Namespace

#### CannotCreateSpline Property

---

|  |
| --- |
| BuiltInFailures SplineFailures Class   See Also |

Can't make Spline.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotCreateSpline { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotCreateSpline As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotCreateSpline { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures SplineFailures Class

Autodesk.Revit.DB Namespace

#### ThermalResistance Property

---

|  |
| --- |
| FamilyThermalProperties Class   See Also |

The calculated thermal resistance value (R-Value). The units are meter-squared kelvin per watt ((m^2\*K)/Watt).

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public double ThermalResistance { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property ThermalResistance As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double ThermalResistance { 	double get (); } ``` |

# See Also

FamilyThermalProperties Class

Autodesk.Revit.DB Namespace

#### HeightOfRunIsTooSmall Property

---

|  |
| --- |
| BuiltInFailures StairRampFailures Class   See Also |

Height of run is too small.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId HeightOfRunIsTooSmall { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property HeightOfRunIsTooSmall As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ HeightOfRunIsTooSmall { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures StairRampFailures Class

Autodesk.Revit.DB Namespace

#### SeparationNotAtJunction Property

---

|  |
| --- |
| BuiltInFailures MEPCalculationFailures Class   See Also |

This hydraulic loop is not separated at any junction. Use the Remove Separation tool to clean up undesired hydraulic separations.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId SeparationNotAtJunction { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SeparationNotAtJunction As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ SeparationNotAtJunction { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures MEPCalculationFailures Class

Autodesk.Revit.DB Namespace

#### RbsElecPanelBranchCircuitApparentLoadPhasea Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Branch Circuit Apparent Load Phase A"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsElecPanelBranchCircuitApparentLoadPhasea { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsElecPanelBranchCircuitApparentLoadPhasea As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsElecPanelBranchCircuitApparentLoadPhasea { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### ConvertToIndependent Method

---

|  |
| --- |
| View Class   Example   See Also |

Convert the dependent view to independent.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public void ConvertToIndependent() ``` |

| Visual Basic |
| --- |
| ``` Public Sub ConvertToIndependent ``` |

| Visual C++ |
| --- |
| ``` public: void ConvertToIndependent() ``` |

# Remarks

This method can be only applied to a dependent view. A dependent view can be created from another view using method View.Duplicate(ViewDuplicateOption.AsDependent). Dependent views have a valid primary view element ID that can be obtained via method View.GetPrimaryViewId(); Independent views have InvalidElementId as their primary view ID.

# Examples

 Copy  C#

```
public void MakeViewIndependent(View view)
{
    // Independent views will have an InvalidElementId for the Primary View Id
    if (view.GetPrimaryViewId() != ElementId.InvalidElementId)
    {
        view.ConvertToIndependent();
    }
}
```

 Copy  VB.NET

```
Public Sub MakeViewIndependent(view As View)
    ' Independent views will have an InvalidElementId for the Primary View Id
    If view.GetPrimaryViewId() <> ElementId.InvalidElementId Then
        view.ConvertToIndependent()
    End If
End Sub
```

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | This view is not dependent. |

# See Also

View Class

Autodesk.Revit.DB Namespace

#### Start Method

---

|  |
| --- |
| TransactionGroup Class   See Also |

Starts the transaction group

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public TransactionStatus Start() ``` |

| Visual Basic |
| --- |
| ``` Public Function Start As TransactionStatus ``` |

| Visual C++ |
| --- |
| ``` public: TransactionStatus Start() ``` |

#### Return Value

If started successfully, this method returns TransactionStatus.Started.

# Remarks

A transaction group can be started only when there is no transaction started currently. It can be started inside another transaction group. When groups are nested inside each other it is required that inner transaction groups are finished (i.e. rolled back, committed, or assimilated) before outer groups are.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | Cannot modify the document for either a read-only external command is being executed, or changes to the document are temporarily disabled. -or- Transaction group cannot be started during an active transaction. -or- The Transaction group has already been started. |

# See Also

TransactionGroup Class

Start Overload

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| LineProperties Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

LineProperties Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| MeshFromGeometryOperationResult Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

MeshFromGeometryOperationResult Class

Autodesk.Revit.DB Namespace

#### Mbh Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol MBH, indicating unit Thousand British thermal units per hour.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId Mbh { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property Mbh As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ Mbh { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### AirDensity Property

---

|  |
| --- |
| DuctSettings Class   See Also |

The air density.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public double AirDensity { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property AirDensity As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double AirDensity { 	double get (); 	void set (double value); } ``` |

# See Also

DuctSettings Class

Autodesk.Revit.DB.Mechanical Namespace